Бухгалтерские_задачи_Занятие_3/src/Documents/ВыплатыДенежныхСредств/ВыплатыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатыДенежныхСредств</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияДенежныхСредств</name>
    <type>
      <types>CatalogRef.МестаХраненияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДвижениеДенежныхСредств</name>
    <type>
      <types>CatalogRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_Занятие_3/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_Занятие_3/src/Documents/ВыплатыДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	Движения.Проводки.БлокироватьДляИзменения = Истина;
	
	Движение = Движения.Проводки.Добавить();
	
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = Сумма;
	Движение.СодержаниеПроводки = "Поступили денежные средства";
	
	Движение.СчетДт = КорСчет;
	
	Движение.СчетКт = МестоХраненияДенежныхСредств.СчетУчета;
	
	Движения.Записать();
	
    //-------Проверка остатка -----
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроводкиОстатки.СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет = &СчетУчетаДС, Организация = &Организация) КАК ПроводкиОстатки
	|ГДЕ
	|	ПроводкиОстатки.СуммаОстатокДт < 0";
	
	СчетУчетаДС = МестоХраненияДенежныхСредств.СчетУчета;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("СчетУчетаДС", СчетУчетаДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нехватает денежных средств. Нехвакта " + ВыборкаДетальныеЗаписи.СуммаОстатокДт;
		Сообщение.Поле = "Сумма";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	
	КонецЕсли;

КонецПроцедуры
